Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CM-LE_DFP/1.2.273/xc32/PIC32CM1216LE00032/startup_pic32cm1216le00032.c
#else /* Legacy defined(_32CM1216LE00032_H) */
        /* Configurable interrupts with Legacy names */
        /* .pfnSYSTEM_Handler       = */ (void*) SYSTEM_Handler,      /* 0  Main Clock */
        /* .pfnWDT_Handler          = */ (void*) WDT_Handler,         /* 1  Watchdog Timer */
        /* .pfnRTC_Handler          = */ (void*) RTC_Handler,         /* 2  Real-Time Counter */
        /* .pfnEIC_EXTINT_0_Handler = */ (void*) EIC_EXTINT_0_Handler, /* 3  External Interrupt Controller */
        /* .pfnEIC_EXTINT_1_Handler = */ (void*) EIC_EXTINT_1_Handler, /* 4  External Interrupt Controller */
        /* .pfnEIC_EXTINT_2_Handler = */ (void*) EIC_EXTINT_2_Handler, /* 5  External Interrupt Controller */
        /* .pfnEIC_EXTINT_3_Handler = */ (void*) EIC_EXTINT_3_Handler, /* 6  External Interrupt Controller */
        /* .pfnEIC_EXTINT_4_Handler = */ (void*) EIC_EXTINT_4_Handler, /* 7  External Interrupt Controller */
        /* .pfnEIC_EXTINT_5_Handler = */ (void*) EIC_EXTINT_5_Handler, /* 8  External Interrupt Controller */
        /* .pfnEIC_EXTINT_6_Handler = */ (void*) EIC_EXTINT_6_Handler, /* 9  External Interrupt Controller */
        /* .pfnEIC_EXTINT_7_Handler = */ (void*) EIC_EXTINT_7_Handler, /* 10 External Interrupt Controller */
        /* .pfnEIC_OTHER_Handler    = */ (void*) EIC_OTHER_Handler,   /* 11 External Interrupt Controller */
        /* .pfnFREQM_Handler        = */ (void*) FREQM_Handler,       /* 12 Frequency Meter */
        /* .pfnNVMCTRL_Handler      = */ (void*) NVMCTRL_Handler,     /* 13 Non-Volatile Memory Controller */
        /* .pvReserved14            = */ (void*) (0UL),               /* 14 Reserved */
        /* .pfnDMAC_0_Handler       = */ (void*) DMAC_0_Handler,      /* 15 Direct Memory Access Controller */
        /* .pfnDMAC_1_Handler       = */ (void*) DMAC_1_Handler,      /* 16 Direct Memory Access Controller */
        /* .pfnDMAC_2_Handler       = */ (void*) DMAC_2_Handler,      /* 17 Direct Memory Access Controller */
        /* .pfnDMAC_3_Handler       = */ (void*) DMAC_3_Handler,      /* 18 Direct Memory Access Controller */
        /* .pfnDMAC_OTHER_Handler   = */ (void*) DMAC_OTHER_Handler,  /* 19 Direct Memory Access Controller */
        /* .pfnUSB_Handler          = */ (void*) USB_Handler,         /* 20 Universal Serial Bus */
        /* .pfnEVSYS_0_Handler      = */ (void*) EVSYS_0_Handler,     /* 21 Event System Interface */
        /* .pfnEVSYS_1_Handler      = */ (void*) EVSYS_1_Handler,     /* 22 Event System Interface */
        /* .pfnEVSYS_2_Handler      = */ (void*) EVSYS_2_Handler,     /* 23 Event System Interface */
        /* .pfnEVSYS_3_Handler      = */ (void*) EVSYS_3_Handler,     /* 24 Event System Interface */
        /* .pfnEVSYS_4_Handler      = */ (void*) EVSYS_4_Handler,     /* 25 Event System Interface */
        /* .pfnEVSYS_5_Handler      = */ (void*) EVSYS_5_Handler,     /* 26 Event System Interface */
        /* .pfnEVSYS_6_Handler      = */ (void*) EVSYS_6_Handler,     /* 27 Event System Interface */
        /* .pfnEVSYS_7_Handler      = */ (void*) EVSYS_7_Handler,     /* 28 Event System Interface */
        /* .pvReserved29            = */ (void*) (0UL),               /* 29 Reserved */
        /* .pfnPAC_Handler          = */ (void*) PAC_Handler,         /* 30 Peripheral Access Controller */
        /* .pfnSERCOM0_0_Handler    = */ (void*) SERCOM0_0_Handler,   /* 31 Serial Communication Interface */
        /* .pfnSERCOM0_1_Handler    = */ (void*) SERCOM0_1_Handler,   /* 32 Serial Communication Interface */
        /* .pfnSERCOM0_2_Handler    = */ (void*) SERCOM0_2_Handler,   /* 33 Serial Communication Interface */
        /* .pfnSERCOM0_OTHER_Handler = */ (void*) SERCOM0_OTHER_Handler, /* 34 Serial Communication Interface */
        /* .pfnSERCOM1_0_Handler    = */ (void*) SERCOM1_0_Handler,   /* 35 Serial Communication Interface */
        /* .pfnSERCOM1_1_Handler    = */ (void*) SERCOM1_1_Handler,   /* 36 Serial Communication Interface */
        /* .pfnSERCOM1_2_Handler    = */ (void*) SERCOM1_2_Handler,   /* 37 Serial Communication Interface */
        /* .pfnSERCOM1_OTHER_Handler = */ (void*) SERCOM1_OTHER_Handler, /* 38 Serial Communication Interface */
        /* .pfnSERCOM2_0_Handler    = */ (void*) SERCOM2_0_Handler,   /* 39 Serial Communication Interface */
        /* .pfnSERCOM2_1_Handler    = */ (void*) SERCOM2_1_Handler,   /* 40 Serial Communication Interface */
        /* .pfnSERCOM2_2_Handler    = */ (void*) SERCOM2_2_Handler,   /* 41 Serial Communication Interface */
        /* .pfnSERCOM2_OTHER_Handler = */ (void*) SERCOM2_OTHER_Handler, /* 42 Serial Communication Interface */
        /* .pvReserved43            = */ (void*) (0UL),               /* 43 Reserved */
        /* .pvReserved44            = */ (void*) (0UL),               /* 44 Reserved */
        /* .pvReserved45            = */ (void*) (0UL),               /* 45 Reserved */
        /* .pvReserved46            = */ (void*) (0UL),               /* 46 Reserved */
        /* .pvReserved47            = */ (void*) (0UL),               /* 47 Reserved */
        /* .pvReserved48            = */ (void*) (0UL),               /* 48 Reserved */
        /* .pvReserved49            = */ (void*) (0UL),               /* 49 Reserved */
        /* .pvReserved50            = */ (void*) (0UL),               /* 50 Reserved */
        /* .pvReserved51            = */ (void*) (0UL),               /* 51 Reserved */
        /* .pvReserved52            = */ (void*) (0UL),               /* 52 Reserved */
        /* .pvReserved53            = */ (void*) (0UL),               /* 53 Reserved */
        /* .pvReserved54            = */ (void*) (0UL),               /* 54 Reserved */
        /* .pfnTC0_Handler          = */ (void*) TC0_Handler,         /* 55 Basic Timer Counter */
        /* .pfnTC1_Handler          = */ (void*) TC1_Handler,         /* 56 Basic Timer Counter */
        /* .pfnTC2_Handler          = */ (void*) TC2_Handler,         /* 57 Basic Timer Counter */
        /* .pvReserved58            = */ (void*) (0UL),               /* 58 Reserved */
        /* .pvReserved59            = */ (void*) (0UL),               /* 59 Reserved */
        /* .pvReserved60            = */ (void*) (0UL),               /* 60 Reserved */
        /* .pvReserved61            = */ (void*) (0UL),               /* 61 Reserved */
        /* .pfnADC_OTHER_Handler    = */ (void*) ADC_OTHER_Handler,   /* 62 Analog Digital Converter */
        /* .pfnADC_RESRDY_Handler   = */ (void*) ADC_RESRDY_Handler,  /* 63 Analog Digital Converter */
        /* .pfnAC_Handler           = */ (void*) AC_Handler,          /* 64 Analog Comparators */
        /* .pfnDAC_UNDERRUN_Handler = */ (void*) DAC_UNDERRUN_Handler, /* 65 Digital-to-Analog Converter */
        /* .pfnDAC_EMPTY_Handler    = */ (void*) DAC_EMPTY_Handler,   /* 66 Digital-to-Analog Converter */
        /* .pfnPTC_Handler          = */ (void*) PTC_Handler,         /* 67 Peripheral Touch Controller */
        /* .pfnTRNG_Handler         = */ (void*) TRNG_Handler,        /* 68 True Random Generator */
        /* .pvReserved69            = */ (void*) (0UL),               /* 69 Reserved */
        /* .pfnTRAM_Handler         = */ (void*) TRAM_Handler         /* 70 TrustRAM */
#endif
};

#pragma GCC diagnostic pop

 
